Page({
  data: {
    articles: {
      '0': {
        author: '俺村一枝花（知乎用名）',
        title: '坐月子时婆婆送我一箱泡面吃，现她生病，我送一箱泡面一箱火腿肠',
        content: [
          '跟老公结婚5年，孩子3岁，今天老公打电话说婆婆生病我不照顾，还送一箱泡面一箱火腿，气的他开始威胁我，说我再不用心照顾他妈就要跟我离婚。看着丈夫那么气急败坏，我居然有种大仇得报的快感。', '坐月子时婆婆送我一箱泡面吃，现她生病，我送一箱泡面一箱火腿肠', '-1-', '我是远嫁，父母都离我远，老公是建筑模板工，常年在外，一年就一两个月在家，当年生孩子都是我独自去的医院，等孩子出生，婆婆才到，老公就连月子坐完也没回来看我们娘俩一眼。', '月子婆婆本不想照顾，但看在孙子和他儿子的面子下勉为其难的留下了，但是她连饭都不给我煮，每天不是打麻将就是跳广场舞，还直接扔我一箱番茄鸡蛋味泡面，直言，饿了就吃，方便，有番茄有鸡蛋，营养丰富。', '我是剖腹产，独自照顾孩子本就累，更是没有经历去做饭，饿的我是晕头转向。跟老公反应，他只说婆婆是他妈，没得义务照顾我。没法，我终于熬不住，将我妈从远方叫了过来。', '坐月子时婆婆送我一箱泡面吃，现她生病，我送一箱泡面一箱火腿肠', '-2-最近婆婆生病了，老公一再打电话让我去照顾婆婆，给她做做饭，本来我心里就记恨着他们，加上孩子读幼儿园我要接送，自己又在上班，哪有时间去照看婆婆，于是我就去超市买了一箱泡面和一箱火腿汤送去了。', '刚出婆婆家门，电话就响了。', '老公：我妈生病你不去照顾就算了，还送一箱泡面一箱火腿，你这是在报复吗？', '我：没有啊！我可一直记得月子里你妈给我送的泡面，我这是报恩呢！', '老公：都这么多年了，你怎么就忘不了呢？她是长辈，我们做子女的不能太过计较。我：我没计较啊！我不是要上班，还得照顾孩子吗，是真没时间给她做饭，我买的可是番茄鸡蛋味，有鸡蛋有番茄，营养价值高，我还送了件火腿肠，这不连肉也有了，我真聪明。老公：那可是我亲妈，你怎么能这样对她，明天把工作辞了，好好道歉，好好照顾我妈去。我：你想的倒是很美，知道我这个工作找了多久吗？能上班能接孩子，我不同意。老公：我不管，你不去照顾我妈我们就离婚，我找个孝顺我爸妈的媳妇去。', '我：那你就去找吧！', '坐月子时婆婆送我一箱泡面吃，现她生病，我送一箱泡面一箱火腿肠'
        ]
      },
      '1': {
        title: '我的老公年薪三十万 可他在我眼里就是废物一个',
        author: '养娃全是坑（知乎用名）',
        content: ['我们在外人看来是很不错的家庭，一个可爱的女儿，定居北京，有房有车，他在银行工作，年薪差不多30万。', '可现如今我觉得他在我眼里形同虚设。', '这可能要从我被辞退开始，2011年9月我作为外聘人员进入一家事业单位，可是到年底的时候却意外怀孕，但是我不想去做流产，我在意我的孩子，后来部门主任知道我怀孕了，他大为生气，私下认为我是找事业单位为下家，生孩子才是目的。从此以后就接下了梁子。知道我怀孕的第一天，就让我把一本厚厚的军事书籍在三天内整理出电子稿来，是要先一页一页扫描出来，然后再用汉语识别软件。我白天加晚上，熬了整整一周才完成。尽管态度端正，但是后来也没摆脱被辞退的厄运。', '2015年夏，部门主任借口我的编外合同到期，把我辞退，当时我不肯离开，我恳求说，看在我是一个母亲的份上，把我留下，我一直很努力，如果我哪儿做的不好可以改正。那时候是我的母亲帮我带小孩。所以，我没必要回家做全职主妇。但是，我们那个很无情的部门主任，很冷地对我说，你应该把机会让给年轻人，你在我这里五年，我已经仁至义尽，没理由再帮你养孩子。', '我觉得这个世界真现实，一个月2000块，帮我养孩子，难道我不是每天在好好工作？那时候我很苦闷，老实说，被辞退真的很丢人，我不好同老公讲，但还是照实说了。他当时劝我，如果真的留不下，再找别的，也可以先回家带带女儿。', '其实我的运气不怎么好，我有多年的编辑经验，虽然很容易在外面找到工作，但外面的创业公司总是破产，所以一连换了两家公司，虽然工资待遇提高到8千，但始终不太稳定。', '到了2015年底，因为我爸妈身体不太好，新入职的公司又垮掉了，我的状态也不太好，于是经他同意，我变成了全职妈妈。当时他说，你安心在家带一段时间女儿，等闺女上了幼儿园，这样再找一份稳定的工作。', '到了2016年夏天，女儿终于在一家私立幼儿园稳定下来，可是因为初上幼儿园不适应，大半年的时间里，还是没能全职去工作，我们的夫妻关系却越来越紧张。']
      }
    }
  },

  onLoad: function (options) {
    let id = options.id;
    this.setData({
      article: this.data.articles[id]
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})